import random
rice=["김치찌개","된장찌개","부대찌개","순두부찌개","제육볶음","불고기","감자탕","육개장","해장국","설렁탕","삼계탕","백반"]
noodle=["짜장면","파스타","라면","우동","쌀국수","잔치국수","냉면","칼국수","비빔국수","쫄면"]
another=["피자","스테이크","돈까스","햄버거","샌드위치","삼겹살"]

place=["한강","놀이공원","영화관","카페","수영장","아쿠아리움","동물원","민속촌","찜질방","피씨방","노래방"]
clothes=["맨투맨+슬렉스","원피스","흰티셔츠+청바지","니트+면바지","후드티+츄리닝","져지풀세트","과잠","체크난방+청바지","블라우스+미니스커트"]

print("="*63)
print("이 프로그램은 현대인들의 결정장애를 해결해주는 프로그램입니다.")
print("="*63)
while(1):
    n=input("무엇을 결정해 드릴까요? \n(1.음식 2.데이트장소 3.옷 4.그만두기) ")
    if n=='1':
        a=input("어떤 종류를 원하시나요? \n(1.밥 2.면 3.기타) ")
        if a=='1':
            b=random.choice(rice)
            print("오늘 먹을 메뉴는 %s 입니다.."%b)
        elif a=='2':
            b=random.choice(noodle)
            print("오늘 먹을 메뉴는 %s 입니다.."%b)
        elif a=='3':
            b=random.choice(another)
            print("오늘 먹을 메뉴는 % s입니다.."%b)
        else:
            print("선택할 수 없는 메뉴입니다..")
    elif n=='2':
        b=random.choice(place)
        print("오늘 데이트할 할곳은  %s 입니다.."%b)
    elif n=='3':
        b=random.choice(clothes)
        print("오늘 입을 옷은 %s입니다.."%b)
    elif n=='4':
        print("프로그램을 종료합니다")
        break
    else:
        print("선택할 수 없는 메뉴입니다.")
    print()
